app/views/listings/_form.html.erb

    <%= f.label :category %>
    <%= f.collection_select :category_id, Category.all, :id, :name, { include_blank: "Please select..." }, { class: "form-control" } %>
---
SELECT "categories".* FROM "categories"